<template>
  <div class="m-goodView">
    <div class="pic"><img width="100%" src="./../../images/goodOwners-p10.jpg"></div>
    <div class="form">
      <h3 class="title">一、报名条件</h3>
      <p>参加活动的驾驶员（及名下车辆）须同时满足以下3个条件才可报名。</p>
      <p>（一）近2年内无交通违法记录。</p>
      <p>（二）近3年来未发生重大道路交通事故。</p>
      <p>（三）无治安处罚和刑事处罚记录。</p>
      <h3 class="title">二、报名方式</h3>
      <p>（一）通过深圳交警星级用户平台报名。星级用户可通过深圳交警微信公众号、支付宝城市服务车主服务等渠道参与活动。</p>
      <p>还未注册深圳交警星级用户的朋友，可以通过上述两个渠道注册，报名期内认证通过后即可参与。</p>
      <p>（二）通过平安好车主APP报名。下载平安好车主APP，并按要求注册成功后参与报名。</p>
      <p>（三）快乐1062微信公众号报名。登录快乐1062微信公众号，点击活动宣传推文的“阅读原文”即可参与报名。</p>
      <p>（四）绿色出行申报报名。登陆星级用户服务平台申报停驶的同时，可参与报名。</p>
      <h3 class="title">三、报名资料</h3>
      <p>参与报名的驾驶员，需要承诺如实提交以下资料（星级用户须同意活动主办方调用注册资料）。</p>
      <p>（一）驾驶员姓名。</p>
      <p>（二）驾驶证号码。</p>
      <p>（三）本人名下有车辆的，需提供所有车辆的车牌号码。</p>
      <p>（四）本人手机号码。</p>
      <p>（五）本人近照（正面半身或全身照片）。照片模糊或者打有马赛克等其他不能辨识的情形的，视为资料不合格取消参选资格。</p>
      <h3 class="title">四、活动时间安排</h3>
      <p>（一）自愿报名</p>
      <p>11月13日至19日，符合条件的驾驶人自愿报名。</p>
      <p>11月20日至23日，活动主办方将按照活动规则遴选出400名候选人开展网络票选活动。</p>
      <p>（二）开展网络投票</p>
      <p>11月24日至28日开展网络投票。市民可通过深圳交警公众号、支付宝城市服务星级车主服务或平安好车主APP活动的界面进行投票。每人每天限投票一次，不得通过软件进行刷票，一旦发现刷票行为则取消参与资格。</p>
      <p>（三）公布票选结果</p>
      <p>11月29日投票截止，票数在前300名的候选人确定为平安好车主评选活动的获奖者。</p>
      <p>活动主办方保留最终解释权。</p>
    </div>
  </div>
</template>

<style lang="less" scoped>
.m-goodView {
  background: #2a82d4;
  .form {
    margin: 40px 60px;
  }
  .title {
    font-size: 40px;
    margin-bottom: 20px;
    text-indent: 40px;
    color: #fff;
  }
  p {
    color: #fff;
    font-size: 24px;
    line-height: 40px;
    margin-bottom: 20px;
    font-family: 'serif';
    text-indent: 40px;
  }
  .info {
    color: #fff;
    line-height: 40px;
    margin-bottom: 40px;
    font-size: 24px;
  }
  .mb20 {
    margin-bottom: 20px;
  }
}
</style>