<!--
  描述：绿色出行-申请协议
  时间：2017-07-20
  作者：猪不乐意
  联系：914230482
-->
<template>
  <div class="m-apply">
    <h1 class="title">申请加入"爱我深圳、停用少用、绿色出行"自愿停驶行动协议</h1>
    <div class="m-format">
      <p>爱我深圳、停用少用、绿色出行”行动联席会议办公室（以下简称绿联办）依据本协议的规定为参加深圳市绿色出行行动的车主提供服务。请车主认真阅读并选择接受或不接受本协议。除非接受本协议所有条款，否则无权参加于本协议下开展的绿色出行申报停驶活动。</p>
      <h2>第一章 前言</h2>
      <p>第一条 绿色出行停驶申报是由绿联办通过深圳公安民生警务平台及其他渠道，“爱我深圳 停用少用 绿色出行”版块向绿色出行车主提供的停驶申报服务，具体服务内容主要包括：绿色出行停驶申报、出行短信提示、兑现奖励措施等，具体详情以绿联办当时提供的服务内容为准。</p>
      <p>第二条 为了保障车主的权益，车主在自愿注册使用绿色出行申报系统前，必须仔细阅读并充分理解知悉本协议所有条款。一经注册或使用本系统进行停驶申报即视为对本协议的充分理解和接受。</p>
      <p>第三条 在本协议履行过程中，绿联办可根据情况对本协议进行修改。一旦本协议的内容发生变动，绿联办将通过网上深圳交警官方网站公布最新的协议，不再向车主作个别通知。如果车主不同意绿联办对本协议所做的修改，车主有权停止使用绿色出行申报系统。如果车主继续使用绿色出行申报系统，则视为接受绿联办对本协议所做的修改，并应遵照修改后的协议执行。</p>
      <p>第四条 绿联办对于车主的通知及任何其他的协议、告示或其他关于车主使用绿色出行账户的通知，车主同意绿联办可通过深圳市公安交警局官方网站公告、电子邮件、手机短信等电子方式或常规的信件传递等方式进行，上述通知发送之日视为已送达收件人。因信息传输等原因导致车主未在上述通知发出当日收到该等通知的，绿联办不承担责任。</p>
      <h2>第二章 参加行动的车主</h2>
      <p>第五条 参加绿色出行行动的车主是指符合中华人民共和国法律规定的具有完全民事权利和民事行为能力，能够独立承担民事责任，拥有长期在深圳市内行驶的小型客车的自然人。在使用绿色出行申报系统前，车主必须先在网上深圳公安民生警务平台的绿色出行申报系统上进行注册。</p>
      <p>第六条 参加绿色出行的车主承诺以下事项：</p>
      <ul>
        <li>1、车主必须依绿联办要求提示提供车主本人、名下小型客车真实、最新、有效及完整的资料。</li>
        <li>2、车主有义务维持并更新手机号码、邮寄地址、电子邮箱地址等资料，确保其为真实、最新、有效及完整。若因车主提供任何错误、虚假、过时或不完整的资料，导致绿联办无法按规定兑现奖励的，绿联办不承担任何责任。</li>
      </ul>
      <h2>第三章 绿色出行申报系统</h2>
      <p>第七条 绿联办建设的绿色出行申报系统主要提供绿色出行停驶申报、出行短信提示、兑现奖励措施等服务，具体详情以绿联办当时提供的服务内容为准。车主需要按要求要求填写车主、车辆信息并提交审核，未通过绿联办信息审核的车主将无法使用绿色出行申报系统。</p>
      <p>第八条 绿联办将为通过审核的车主提供以下服务：</p>
      <ul>
        <li>1、告知车主申报方式，并提供绿色出行申报系统操作指引。</li>
        <li>2、停驶日期的申报和取消。</li>
        <li>3、包括联系电话、邮寄地址、电子邮箱地址等在内的基本信息修改。</li>
        <li>4、修改密码、找回密码。</li>
        <li>5、查询本年度的车辆停驶申报情况、履诺情况。</li>
        <li>6、发送基本信息审核结果告知、车辆违诺出行提示等通知短信。</li>
        <li>7、按照规定向星级车主邮寄奖品。</li>
        <li>8、绿联办提供的其他服务。</li>
      </ul>
      <p>第九条 绿联办将采取深圳市公安交警局官方网站公告、电子邮件、手机短信等电子方式或常规的信件传递等方式进行对于车主进行业务通知。</p>
      <p>目前，受通讯运营商，短信业务仅限于移动、联通用户。使用电信号码的车主暂时无法接收短信。</p>
      <h2>第四章 隐私权保护及授权条款</h2>
      <p>第十条 绿联办对于车主提供的、绿联办自行收集的、经认证的个人及车辆信息将按照本协议予以保护。</p>
      <p>第十一条 绿联办按照车主在绿色出行申报系统上的停驶申报行为自动追踪车辆的行驶轨迹。在保障车主隐私资料的前提下，绿联办有权对所有参加绿色出行车辆的行车轨迹进行分析研判。</p>
      <h2>第五章 条款的解释</h2>
      <p>第十二条 本协议是由车主与绿联办共同签订的，适用于车主在绿色出行申报系统内的全部活动。</p>
      <p>第十三条 绿联办对本协议拥有最终的解释权。</p>
    </div>
  </div>
</template>

<script>
export default {
  data () {
    return {
      isLogin: false,
      reading: false
    }
  },
  methods: {
    // 申诉
    toComplaint () {
      // 未登录状态跳转
      if (!this.isLogin) {
        this.$router.push({name: 'starLevel', query: this.queryURL})
      // 已登录跳转
      } else {
        this.$router.push({name: 'greenComplaint', query: this.queryURL})
      }
    },
    // 接受建议
    toStarLever () {
      // 未登录状态跳转
      if (this.reading && !this.isLogin) {
        this.$router.push({
          name: 'login'
        })
      }
      // 已登录跳转
      if (this.reading && this.isLogin) {
        this.$router.push({
          name: 'greenApply'
        })
      }
    }
  },
  computed: {
    queryURL () {
      return this.$store.getters.queryURL
    }
  },
  created () {
    this.isLogin = window.localStorage.getItem('isLogin')
  }
}
</script>

<style lang="less">
@import 'style/greenTravel.less';
</style>
